/**
 * 各项目自行约定相关的产量扩展属性信息
 * 
 * 结合 YT.Format.fmtNsType(key, type) 使用
 * 
 * 格式如下
 */
NS.ACCT_TYPE = {
	SA : "01",// 借记卡
	CC : "02",// 信用卡
	ELE : "04",// 电子账号
	OTH : "08"// 他行卡
};
NS.ACCT_TYPE_NAME = {
	"01" : "借记卡",// 借记卡
	"02" : "信用卡",// 信用卡
	"04" : "电子账号",// 电子账号
	"08" : "他行卡"// 他行卡
};
/**
 * 图标颜色库
 */
NS.ECHART_COLORS = [ '#C1232B', '#B5C334', '#FCCE10', '#E87C25', '#27727B',
		'#FE8463', '#9BCA63', '#FAD860', '#F3A43B', '#60C0DD', '#D7504B',
		'#C6E579', '#F4E001', '#F0805A', '#26C0C0' ];
/**
 * 瑞丰-预警类型(到期类型)
 */
NS.RF_WARN_TYPE = [
	{
		"key":"1",
		"txt":"定期存款到期"
	},
	{
		"key":"2",
		"txt":"授信到期"
	},
	{
		"key":"3",
		"txt":"客户贷款产品到期"
	},
	{
		"key":"4",
		"txt":"承兑汇票到期"
	},
	{
		"key":"5",
		"txt":"结构性存款到期"
	},
	{
		"key":"6",
		"txt":"信用证付款到期"
	},
	{
		"key":"7",
		"txt":"贸易融资到期"
	},
	{
		"key":"8",
		"txt":"理财产品到期"
	},
	{
		"key":"9",
		"txt":"贷款合同到期"
	},
	{
		"key":"10",
		"txt":"抵质押物到期"
	},
	{
		"key":"11",
		"txt":"保险到期"
	},
	{
		"key":"12",
		"txt":"身份证到期"
	},
	{
		"key":"13",
		"txt":"营业执照到期"
	},
	{
		"key":"14",
		"txt":"保管箱到期"
	},
	{
		"key":"15",
		"txt":"异常客户"
	}
]

/**
 * 瑞丰-预警类型(到期类型)
 */
NS.RF_PROCESSING_TYPE = [
	{
		"key":"1",
		"txt":"已处理"
	},
	{
		"key":"2",
		"txt":"未处理"
	}
];
/**
 * 瑞丰-异动方向
 */
NS.RF_DC_FLAG = [
	{
		"key":"1",
		"txt":"转入"
	},
	{
		"key":"2",
		"txt":"转出"
	}
];
/**
 * 瑞丰-客户类型
 */
NS.RF_CUST_TYPE = [
	{
		"key":"2",
		"txt":"对公"
	},
	{
		"key":"1",
		"txt":"零售"
	}
];
/**
 * 瑞丰-关怀类型
 */
NS.RF_CARE_TYPE = [
	{
		"key":"2",
		"txt":"生日关怀"
	}
];


